// let arr1 = [1, 2, 3, 4, 56, 7, 8, 9, 9]; // 第一个班级的成绩
// let arr2 = [1, 2, 3, 4, 56, 7, 8, 9, 9]; // 第二个班级的成绩
// let arr3 = [1, 2, 3, 4, 56, 7, 8, 9, 9]; // 第三个班级的成绩



// let arr = [
//     [1, 2, 3, 4, 56, 7, 8, 9, 9], // 第一个班级的成绩
//     [1, 2, 3, 4, 56, 7, 8, 9, 9],// 第二个班级的成绩
//     [1, 2, 3, 4, 56, 7, 8, 9, 9] // 第三个班级的成绩
// ]


// let students = [
//     ['张三',17,'男'],
//     ['李四',26,'女'],
//     ['王二麻子',35,'未知']
// ];




let arr = [
    [1, 2, 3, 4, 56, 17, 8, 9, 9], // 第一个班级的成绩
    [1, 2, 3, 4, 56, 27, 8, 9, 9],// 第二个班级的成绩
    [1, 2, 3, 4, 56, 37, 8, 9, 9] // 第三个班级的成绩
]
// 第一个班级的学号为5的同学的成绩
// let childArr = arr[0];
// console.log(childArr);
// console.log(childArr[5]);
console.log(arr[0][5]);




