/* 
语法：
for(初始化循环变量表达式; 循环条件表达式; 更新循环变量表达式){ // 注意，这三者之间是;连接
		循环体;
}
*/

/* 

流程：
1. 初始化循环变量表达式
2. 判断变量是否满足循环条件表达式 如果满足 就继续  否则 整个循环结束
3. 执行循环体
4. 更新循环变量表达式
2
3
4
2
3
4
......
2 条件不满足循环结束
*/

// for(let i = 0; i <= 100; i++) {
//     console.log('做俯卧撑');
// }

// for(let i = 10; i <= 110; i++) {
//     console.log('做俯卧撑');
// }

// for(let i = 0; i >= 100; i++) {
//     console.log('做俯卧撑');
// }

// for(let i = 0; i <= 100; i+1) { // 是死循环  更新循环变量表达式 一定要是赋值运算
//     console.log('做俯卧撑');
// }











