 // = 赋值运算符 将=右边的表达式的结果/值 赋值给=左边的变量
// let a = 10;
// let num1 = 20,num2 = 20;
// let num = num1 + num2;
// console.log(num);

// 面试题：  =  ==  === 的区别


// -=  
// a -= b   ->  等效于 a = a - b; 将a-b之后的结果 再赋值给a

// let num1 = 50,num2 = 20;
// num1 -= num2; //  等效于：    num1 = num1 - num2;
// num1重新赋值了 所以就改变了 num2没有对他做操作 所以它没有改变
// console.log(num1,num2); // 30   20

// +=  
// a += b   ->  等效于 a = a + b; 将a+b之后的结果 再赋值给a

// let num1 = '6',num2 = 1;
// num1 += num2; //  等效于：    num1 = num1 + num2;
// console.log(num1,num2); // 61   1






//  ++
// 前置++   ++在变量前面，就叫前置++
//在运算过程中  先自增1 再（拿取自增1之后的值）参与运算
// let a = 5, b = 7, c;
// c = ++a + b;
// //    6 + 7
// console.log(a, b ,c); // 6  7  13



// 后置++
// 后置++   ++在变量后面，就叫后置++
//在运算过程中  先（拿之前的值）参与运算   再自增1
// let a = 5, b = 7, c;
// c = a++ + b;
// //  5 +   7
// console.log(a, b ,c); // 6  7  12









// let a = 5, b = 7, c;
// c = a++ + b++;
// //  5 +  7
// console.log(a, b ,c); // 6  8  12

// let a = 5, b = 7, c;
// c = ++a + ++b;
// //  6 +  8
// console.log(a, b ,c); // 6  8  14

// let a = 5, b = 7, c;
// c = ++a + ++b + a++ + ++b + a++;
// // 6  +  8 +  6   +  9  + 7
// // 6  +  8 +  6   +  9  + 7
// console.log(a, b ,c); // 8  9  36





let a = 5, b = 7, c;
c = ++a + ++b + a++ + ++b + a++ + a-- - --a  + b--;
// 6  +  8 +    6   +   9  + 7
// 6  +  8 +    6   +   9  + 7  + 8   -  6   +  9
// 6  +  8   +   9  + 7  + 8    +  9
console.log(a, b ,c); // 6  8  47
